# 1. بنستخدم نسخة Node.js مستقرة وخفيفة
FROM node:18-slim

# 2. بنحدد مجلد الشغل جوه الكونتينر
WORKDIR /app

# 3. بننسخ ملفات الـ package.json الأول (عشان نستفيد من الـ Cache في السرعة)
COPY package*.json ./

# 4. بنثبت المكتبات
RUN npm install

# 5. بننسخ باقي ملفات الكود كلها
COPY . .



# 6. بننشئ مجلد الرفع وبنديله صلاحيات كاملة عشان الصور تترفع
RUN mkdir -p uploads && chmod 777 uploads

# 7. بنعرف الموقع إننا هنستخدم بورت 3000 (أو أي بورت الموقع هيوفره)
EXPOSE 3000




# 8. أهم سطر: تشغيل السيرفر
CMD ["node", "index.js"]